Stuff for the Sac and Jane paper on turbulence diagnostics

* Conclusions
+ Structure function has big advantage that it is relatively immune to effects of thermal broadening and poor instrumental resolution
+ Allows successful recovery of \kappa(v_i) (to \pm0.1) for 2 out of 3 viewing angles
  + But is sometimes affected by champagne flows => one would deduce a steeper spectrum than is really present
+ VCA 


 
* Why projection smoothing may not happen
- Projection smoothing makes the 2D structure (or autocorrelation) function steeper than the 3D one by 1.
- It will only happen for transverse scales smaller than the line-of-sight depth of the emitting layer
  + If there were a unique scale for the line-of-sight depth of the emitting layer, then there should be a break in the structure function at that scale
  + But since there will be a distribution of LOS depths, we will instead see a curvature of the structure function
    + We could measure the LOS depths - maybe for the observational paper
    + For instance z = \int \eta dz / \eta_max - although this would be a lower limit on the real effective depth
- But there is also the Brunt & Mac Low (2004) effect, where density fluctuations have an effect on the velocity centroids that can fully or partially cancel out the projection smoothing
*** Shapes of the structure functions
+ For all but the "champagne flow" case, the structure functions have negative curvature over the "power law" range
  + That is \partial{}^{2}S_2/\partial{}l^2 < 0
  + This might be hint of passing from thick to thin regime, see above
+ For looking down the z-axis, where we see a champagne flow, the structure functions have a curvature in the opposite direction
  

* Slopes of VCA power spectra

** From Esquivel, Lazarian, Pogosyan, & Cho (2003)
+ n is 3D density spectral index (negative)
  + We have \kappa = n + 2, but we also use m for same thing
  + In our case, it is the emissivity rather than density that is relevant
  + Simulations:
    + \kappa(d_i) \simeq -1.2
    + \kappa(d_i^2) = \kappa(H\alpha) \simeq -1.1 \to -0.8 \to -0.9
    + \kappa([O III]) \simeq -1.5 \to -1.3
  + The shallow/steep boundary is at -1 in our units, so we are hovering around the boundary, with [O III] steep and H\alpha shallow
+ \mu is 3D velocity spectral index (negative)
  + Simulations have \kappa(v_i) \simeq -1.3 \to -1.1 \to -1.2 
+ \gamma is spectral index in velocity slices (negative)
+ m is structure function index of the velocity (positive)
  + We use 2\gamma for the same quantity, but then use m in the table
    + This comes from \Delta{}v_rms \sim L^\gamma
    + Kolmogorov,Burger predict \gamma = 1/3,1/2 => m_{3D} = 2/3,1
  + But this is 3D, not 2D.  Does it make a difference?
    + *Maybe*
      + Projection smoothing gives m_{2D} = m_{3D} + 1
      + But we can have m_{2D} = m_{3D} in certain cases:
        1. If line-of-sight depth of emitting region is smaller than separation scale
        2. In driven turbulence, correlations \Delta\rho-\Delta{}v can undo the projection smoothing (Brunt & Mac Low 2004)
    + Simulation measurements have
      + m_{2D}(H\alpha) = 0.5-0.6
      + m_{2D}([O III]) = 0.6-0.8
      + Except for xy plane where it reaches 1.0
    + *If we believe projection smoothing* => m_{3D} \approx -0.45 (H\alpha) or -0.3 ([O III])
      + If we don't, then it could be anywhere in the range m_{3D} \approx -0.45 \rightarrow 0.55
    + Prediction from velocity power spectrum is
      + m = -3 - \mu = -1 - \kappa(v_i) = 0.3 \to 0.1 \to 0.2

\alpha\beta\gamma\delta\epsilon\zeta\eta\theta\iota\kappa\lambda\mu\nu\omicron\pi\varpi\rho\sigma\tau\upsilon\xi\chi\omega \Alpha\Beta\Gamma\Delta\Epsilon\Zeta\Eta\Theta\Iota\Kappa\Lambda\Mu\Nu\Omicron\Pi\Rho\Sigma\sum\Tau\Upsilon\Xi\Chi\Omega

*** Relation between velocity energy spectrum \mu and structure function m
+ In three dimensions: \mu = -3 - m
+ From simulations: m = -0.45 \rightarrow 0.55 => \mu = -2.55 \rightarrow -3.55
+ Whereas really the simulations have \mu = -3.2 \pm 0.1

*** Relation between m and VCA slope \gamma
**** Shallow density spectrum:
+ \gamma_{thin} = n + m/2
+ \gamma_{thick} = n
+ => m = 2 (\gamma_{thin} - \gamma_{thick})
**** Steep density spectrum:
+ \gamma_{thin} = -3 + m/2
+ \gamma_{thick} = -3 - m/2
+ \gamma_{THICK}_{} = n  (THICK means basically the whole line)
**** Our simulations
+ We have \mu = -3.2 \pm 0.1, m = 0.2 \pm 0.1, n([O III]) = -3.4 \pm 0.1, n(H\alpha) = -2.95 \pm 0.15
***** Predicted [O III] steep
+ \gamma_{thin} = -2.8 \pm 0.1 - observed (NB): -2.06 \pm 0.03
+ \gamma_{thick} = -3.2 \pm 0.1 - observed: -2.67 \pm 0.04
+ \gamma_{THICK}_{} = -3.4 \pm 0.1 - observed: -3.34 \pm 0.03
***** Predicted H\alpha shallow
+ \gamma_{thin} = -2.85 \pm 0.15
+ \gamma_{thick} = -2.95 \pm 0.15

**** Other stuff
+ => m = (\gamma_{thin} - \gamma_{thick})
+ AND \gamma_{thick} - \gamma_{THICK}_{} = (-3 - n) - m/2
+ => m = 2 [(-3 - n) - (\gamma_{thick} - \gamma_{THICK}_{})]
+ OR \gamma_{THICK}_{} - \gamma_{thin} = n + 3 - m/2 => m = 2 [ (n + 3) - (\gamma_{THICK}_{} -  \gamma_{thin})]
+ For [O III], n = -3.3 => (-3 - n) = 0.3
+ => m = 2 [0.3 - (\gamma_{THICK}_{} -  \gamma_{thick})]
+ OR m = -2 [(\gamma_{THICK}_{} -  \gamma_{thin}) + 0.3]

** Simulation [O III] slopes
| Time |          Thick |        Thin NB |         Thin B |       Diff NB |        Diff B |              m | m |
|------+----------------+----------------+----------------+---------------+---------------+----------------+---|
|   15 |          -2.58 |          -1.32 |          -2.01 |          1.26 |          0.57 |          -0.54 |   |
|   20 |          -2.32 |          -1.13 |          -1.74 |          1.19 |          0.58 |          -0.56 |   |
|   25 |          -2.37 |          -1.07 |          -1.66 |           1.3 |          0.71 |          -0.82 |   |
|   30 |          -2.38 |          -0.98 |          -1.57 |           1.4 |          0.81 |          -1.02 |   |
|------+----------------+----------------+----------------+---------------+---------------+----------------+---|
|   15 |          -2.14 |          -1.07 |          -1.85 |          1.07 |          0.29 |           0.02 |   |
|   20 |          -2.18 |          -1.04 |          -1.64 |          1.14 |          0.54 |          -0.48 |   |
|   25 |          -2.31 |          -1.03 |          -1.59 |          1.28 |          0.72 |          -0.84 |   |
|   30 |          -2.39 |          -0.97 |          -1.56 |          1.42 |          0.83 |          -1.06 |   |
|------+----------------+----------------+----------------+---------------+---------------+----------------+---|
|   15 |          -2.42 |          -0.98 |          -1.60 |          1.44 |          0.82 |          -1.04 |   |
|   20 |          -2.26 |          -1.01 |          -1.58 |          1.25 |          0.68 |          -0.76 |   |
|   25 |          -2.34 |          -0.99 |          -1.59 |          1.35 |          0.75 |           -0.9 |   |
|   30 |          -2.43 |          -1.10 |          -1.68 |          1.33 |          0.75 |           -0.9 |   |
|------+----------------+----------------+----------------+---------------+---------------+----------------+---|
|      | -2.34 +/- 0.03 | -1.06 +/- 0.03 | -1.67 +/- 0.04 | 2.34 +/- 0.03 | 2.34 +/- 0.03 | -4.08 +/- 0.06 |   |
#+TBLFM: $5=$3 - $2::$6=$4 - $2::$7=2(0.3 - $6)::@14$2..@14$4=vmeane(@I..@IIII); f2



** Original data tables from Jane



*** vca-11-tab.dat - z-axis
          Thick            Thin

Halpha
No broadening
15        -1.65           -1.11		
20        -1.63           -1.00
25        -1.61           -0.88
30        -1.56           -0.85
Broadening
15        -1.65           -1.65
20        -1.63           -1.56
25        -1.61           -1.42
30        -1.56           -1.30

O35007
No broadening
15        -2.58           -1.32
20        -2.32           -1.13
25        -2.37           -1.07
30        -2.38           -0.98
Broadening
15        -2.58           -2.01
20        -2.32           -1.74
25        -2.37           -1.66
30        -2.38           -1.57

N26584
No broadening
15        -1.41           -0.80
20        -1.61           -0.83
25        -1.42           -0.81
30        -1.58           -0.89
Broadening
15        -1.41           -1.24
20        -1.61           -1.31
25        -1.42           -1.23
30        -1.58           -1.30

S26716
No broadening
15        -1.13           -0.46
20        -1.03           -0.41
25        -0.84           -0.28
30        -0.85           -0.24
Broadening
15        -1.13           -0.85
20        -1.03           -0.84
25        -0.84           -0.65
30        -0.85           -0.58

*** vca-21-tab.dat - y-axis
          Thick            Thin

Halpha
No broadening
15        -1.52           -0.96                    		
20        -1.55           -0.93
25        -1.60           -0.92
30        -1.53           -0.86
Broadening
15        -1.52           -1.61
20        -1.55           -1.48
25        -1.60           -1.38
30        -1.53           -1.33

O35007
No broadening
15        -2.14           -1.07        
20        -2.18           -1.04
25        -2.31           -1.03
30        -2.39           -0.97
Broadening
15        -2.14           -1.85
20        -2.18           -1.64
25        -2.31           -1.59
30        -2.39           -1.56

N26584
No broadening
15        -1.38           -0.70
20        -1.48           -0.84
25        -1.61           -0.89
30        -1.52           -0.86
Broadening
15        -1.38           -1.16
20        -1.48           -1.26
25        -1.61           -1.33
30        -1.52           -1.29

S26716
No broadening
15        -0.96           -0.29
20        -0.82           -0.34
25        -1.19           -0.51
30        -0.92           -0.24
Broadening
15        -0.96           -0.64
20        -0.82           -0.65
25        -1.19           -0.91
30        -0.92           -0.61

*** vca-31-tab.dat - x-axis
          Thick            Thin

Halpha
No broadening
15        -1.66           -0.92                            		
20        -1.49           -0.91
25        -1.62           -0.90
30        -1.66           -0.94
Broadening
15        -1.66           -1.62
20        -1.49           -1.40
25        -1.62           -1.45
30        -1.66           -1.42

O35007
No broadening
15        -2.42           -0.98        
20        -2.26           -1.01
25        -2.34           -0.99
30        -2.43           -1.10
Broadening
15        -2.42           -1.60
20        -2.26           -1.58
25        -2.34           -1.59
30        -2.43           -1.68

N26584
No broadening
15        -1.42           -0.80
20        -1.44           -0.82
25        -1.63           -0.88
30        -1.66           -0.91
Broadening
15        -1.42           -1.25
20        -1.44           -1.25
25        -1.63           -1.34
30        -1.66           -1.39

S26716
No broadening
15        -1.21           -0.57
20        -1.09           -0.44
25        -0.96           -0.29
30        xxx             xxx
Broadening
15        -1.21           -0.93
20        -1.09           -0.80
25        -0.96           -0.75
30        xxx             xxx





